life/problem-solving.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-31 Tue 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/org"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb72bbc">1. When you can't figure out how to solve the problem</a></li>
<li><a href="#org850ffe6">2. When you can't decide what to do</a></li>
<li><a href="#org4f71f2e">3. If you don't know where to start</a></li>
</ul>
</div>
</div>
<p>
When faced with a problem you do not know how to solve, it is helpful to have a pre-planned procedures that serve as immediate reactions to the cue of no clear next step being visible.
</p>

<div id="outline-container-orgeb72bbc" class="outline-2">
<h2 id="orgeb72bbc"><span class="section-number-2">1</span> When you can't figure out how to solve the problem</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Write the problem down in as much detail as possible.</li>
<li>Write down what exactly would constitute a solution.</li>
<li>Write down why I need to solve this exact problem and why it cannot be anything simpler.</li>
<li>Write down a list of examples of the problem and try to solve each one by hand.</li>
<li>Write down any problems that are already solved and seem related to the current one. See if the solutions can be adapted.</li>
<li>Write down similar, but easier problems. Try to solve them.</li>
<li>Try each of the heuristics from "How To Solve It".</li>
<li>Explain all of the above to somebody.</li>
</ul>
</div>
</div>

<div id="outline-container-org850ffe6" class="outline-2">
<h2 id="org850ffe6"><span class="section-number-2">2</span> When you can't decide what to do</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Write the problem down.</li>
<li>Write down the criteria by which you should judge each option.</li>
<li>Write down all the options that come to mind.</li>
<li>Write down their pros and cons.</li>
<li>If possible, go do something else instead (to enable background processing).</li>
<li>Otherwise, start a pomodoro and at the end pick the least bad option.</li>
</ul>
</div>
</div>

<div id="outline-container-org4f71f2e" class="outline-2">
<h2 id="org4f71f2e"><span class="section-number-2">3</span> If you don't know where to start</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>List all the things that need to happen, in time order.</li>
<li>If the first thing on the list is something you can do - do it.</li>
<li>Otherwise, take the first thing on the list and break it down into smaller steps.</li>
</ul>

<p>
The key point of these techniques is generating momentum - you are taking smaller steps, but cross the procrastination barrier.
You also optimize for smaller, but consistent rewards - that should help against feeling defeated.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:elkorn@arch">elkorn@arch</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
